# IsMaxEdgeLengthSet Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
OBJExportOptions..::..IsMaxEdgeLengthSet Method
OBJExportOptions Class See Also
---
Checks whether the MaxEdgeLength tessellation parameter is explicitly set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public bool IsMaxEdgeLengthSet()
```

Visual Basic
---
```text
Public Function IsMaxEdgeLengthSet As Boolean
```

Visual C++
---
```text
public:
bool IsMaxEdgeLengthSet()
```

# ### Return Value
True if MaxEdgeLength tessellation parameter is explicitly set, false otherwise.
# See Also
OBJExportOptions Class
Autodesk.Revit.DB Namespace